src/Reports/СистемныйБаланс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>СистемныйБаланс</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СписокРазделов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивСмен</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Reports/СистемныйБаланс/Forms/ФормаОтчета/module.bsl
Перем Список;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура ДействияФормыНастройка(Кнопка)
	Форма =  ПолучитьФорму("ФормаНастройки", ЭтаФорма);
	Форма.ОткрытьМодально();
	
КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ФормированиеОтчетов.ПередОткрытиемОтчета(ЭтаФорма);
КонецПроцедуры

Процедура ПриОткрытии()
	Если Не ЗначениеЗаполнено(СписокРазделов) Тогда
		СписокРазделов = Список;
		Для Каждого Раздел Из СписокРазделов Цикл
			Раздел.Пометка = Истина;
		КонецЦикла;	
	Иначе
		Если СписокРазделов.Количество() = 4 Тогда
			СписокРазделов.Добавить(5,"Раздел5. Скидки/Наценки");	
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МестоРеализации) Тогда
		МестоРеализации = Константы.ОсновноеМестоРеализации.Получить();
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаС) И Не ЗначениеЗаполнено(ДатаПо) И Не ЗначениеЗаполнено(МассивСмен) Тогда 
		ДатаС = НачалоДня(ТекущаяДата());
		ДатаПо = ТекущаяДата();
		Период = ПредставлениеПериода(ДатаС,ДатаПо);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДействияФормыСформировать(Кнопка)
	СформироватьОтчет(ЭлементыФормы.Результат)
КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Перем ВыполненноеДействие;
	Перем  Область;
	СтандартнаяОбработка=Ложь;
	
	Расшифровка.Свойство("Область",Область);
	
	Если НЕ Область = "НачисленияПоКартам" Тогда
	
		ТаблицаЗаказов = Новый ТаблицаЗначений;
		Расшифровка.Свойство("Данные",ТаблицаЗаказов);
		
		Макет = ПолучитьМакет("Расшифровка");
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.Период = Период; 		
		
		Форма = ПолучитьФорму("ФормаРасшифровки");
		Форма.Открыть();
		Таб = Форма.ЭлементыФормы.Результат;
		Таб.Очистить();
		КоличествоСтрок = 0;
		Таб.Вывести(ОбластьЗаголовок);
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка1");
		ОбластьИтого = Макет.ПолучитьОбласть("Итого");
		
		Таб.Вывести(ОбластьШапка);
		н = 1;
		ИтогоСумма  = 0;
		ИтогоГостей = 0;
		Для Каждого Строка Из ТаблицаЗаказов Цикл
			Если Область = "Выручка" Или Область = "Удаления"  Тогда
				Заказ = Строка.Заказ;
			Иначе
				Заказ = ?(Лев(Область,5)="Заказ",Строка[Область],Строка.Ссылка);
			КонецЕсли;
			
			Если ТипЗнч(Заказ) = Тип("ДокументСсылка.Заказ") Тогда
				ОбластьСтрока.Параметры.Заказ = Заказ;
				ОбластьСтрока.Параметры.Чел   = Заказ.КоличествоПосетителей;
				ОбластьСтрока.Параметры.Сумма = Заказ.ИтоговаяСумма;
				ОбластьСтрока.Параметры.СтрРасшифровки = Заказ;
				Таб.Вывести(ОбластьСтрока);
				н = н+1;
				ИтогоСумма  = ИтогоСумма + Заказ.ИтоговаяСумма;
				ИтогоГостей = ИтогоГостей + Заказ.КоличествоПосетителей; 
			КонецЕсли;
		КонецЦикла;
			
		ОбластьИтого.Параметры.Чел = ИтогоГостей;
		ОбластьИтого.Параметры.Сумма = ИтогоСумма;
	    Таб.Вывести(ОбластьИтого);
		
	Иначе
		
		Если Расшифровка.Данные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Отчет = Отчеты[Область].Создать();
		
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		Отчет.РасшифровыватьПоДокументам = Истина;
		
		Отчет.ДатаС = ЭтотОбъект.ДатаС;
		Отчет.ДатаПо = ЭтотОбъект.ДатаПо;
		Отчет.Период = ЭтотОбъект.Период;
		
		// установим группировки 
		ТаблицаГруппировокСтроки = ФормированиеОтчетов.ПолучитьПустуюТаблицуНастроекОтчета("Группировки");
		
		НоваяСтрока = ТаблицаГруппировокСтроки.Добавить();
		НоваяСтрока.Поле           = "Начисление";
		НоваяСтрока.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
		
		ТаблицаГруппировокКолонки = ФормированиеОтчетов.ПолучитьПустуюТаблицуНастроекОтчета("Группировки");
		
		НоваяСтрока = ТаблицаГруппировокКолонки.Добавить();
		НоваяСтрока.Поле           = "ВариантОплаты";
		НоваяСтрока.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
		
		ФормированиеОтчетов.СформироватьОтчетПоПараметрам(Отчет, ТаблицаГруппировокСтроки, ТаблицаГруппировокКолонки, );
			
	КонецЕсли;
	
	
КонецПроцедуры


Процедура КнопкаПериодаНажатие(Элемент)
	ФормированиеОтчетов.КнопкаПериодНажатие(ЭтотОбъект);
КонецПроцедуры

Процедура КнопкаСменыНажатие(Элемент)
	ФормированиеОтчетов.КнопкаСменаНажатие(ЭтотОбъект);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ТЕЛО МОДУЛЯ

Список = Новый СписокЗначений;
Список.Добавить(1,"Раздел1. Выручка");
Список.Добавить(2,"Раздел2. Удаления");
Список.Добавить(3,"Раздел3. Средние показатели");
Список.Добавить(4,"Раздел4. Расшифровка по статусу заказов");
Список.Добавить(5,"Раздел5. Скидки/Наценки");
Список.Добавить(6,"Раздел6. Начисления/Удержания");
